# St. Louis Cardinals Vs. Chicago Cubs
Historically there has been a great baseball rivaly between the Cardinals and the Cubs.  Python and Sqlite3 will be used to evaluate the history of the ball teams to determine which team is the best.

In [96]:
import sqlite3
import pandas as pd
import matplotlib.pyplot as plt

In the next cell I create a baseball database and read in the csv file that has the annual team data from 1871-2018.

In [104]:
con = sqlite3.connect('mlbbaseball.db')
mlb_df = pd.read_csv('../../../Desktop/Teams.csv', index_col=None, na_values=['NA'])

Next I add the team_table to my baseball database.

In [98]:
mlb_df.to_sql("team_table", baseball, if_exists = "replace")

When it comes to baseball the best team is always determined by who wins the **World Series**.  Since 1903 the top team from the American League and the National League have fought to be World Champions over a series of seven (used to be nine) games.  The most obvious way to determine which team is best is to figure out how many times each team has been the top in their league since 1903.

In [102]:
ws_df = pd.read_csv('../../../Desktop/SeriesPost.csv', index_col=None, na_values=['NA'])
ws_df.to_sql("WorldSeries_table", baseball, if_exists = "replace")

In [139]:
ws_df = pd.read_sql_query("SELECT yearID, teamIDwinner FROM WorldSeries_table WHERE round = 'WS' AND (teamIDwinner = 'SLN' OR teamIDwinner = 'CHN')", con)
ws_df

    yearID teamIDwinner
0     1885          CHN
1     1907          CHN
2     1908          CHN
3     1926          SLN
4     1931          SLN
5     1934          SLN
6     1942          SLN
7     1944          SLN
8     1946          SLN
9     1964          SLN
10    1967          SLN
11    1982          SLN
12    2006          SLN
13    2011          SLN
14    2016          CHN

This really is not a fair judge of the teams.  Any baseball fan knows about **The Curse of the Billy Goat**, a 71 year curse that prohibited the Cubs from winning a World Series.  A better way to judge the two teams to see who has the best record of wins over loss.

In [143]:
slnwinlos_df = pd.read_sql_query("SELECT yearID, teamID, SUM(W), SUM(L) FROM team_table WHERE yearID > 1881 AND (teamID = 'SLN' OR teamID = 'SL4') ORDER BY teamID", con)
chnwinlos_df = pd.read_sql_query("SELECT yearID, teamID, SUM(W), SUM(L) FROM team_table WHERE yearID > 1881 AND teamID = 'CHN' ORDER BY teamID", con)
# slnwinlos_df
# chnwinlos_df

The Cubs team started playing ball in 1876 and the Cardinals team was started in 1882.  Given this 6 year difference the team wins and losses before 1882 were excluded from this query.  The St Louis team that started playing ball in 1882 was originally called the Brown Stockings.  The team information from the Brown Stockings were included in the query.  In 1900 the team was renamed the Cardinals.  Nothing in the team was changed other than their name.  This is why the Brown Stocking information was included in the query.  A team is not made on wins and losses alone.  Without a great pitching staff a baseball team is nothing.

In [149]:
pitches_df = pd.read_sql_query("SELECT teamID, ERA, BBA, SOA FROM team_table WHERE yearID > 1881 AND (teamID = 'SLN' OR teamID = 'SL4' OR teamID = 'CHN') ORDER BY yearID", con)
sln_pitches_df = pd.read_sql_query("SELECT teamID, avg(ERA), SUM(BBA), SUM(SOA) FROM team_table WHERE yearID > 1881 AND (teamID = 'SLN' OR teamID = 'SL4')", con)
sln_pitches_df

  teamID  avg(ERA)  SUM(BBA)  SUM(SOA)
0    SLN  3.672555     63614     95800

In [150]:
chn_pitches_df = pd.read_sql_query("SELECT teamID, avg(ERA), SUM(BBA), SUM(SOA) FROM team_table WHERE yearID > 1881 AND teamID = 'CHN' ", con)
chn_pitches_df

  teamID  avg(ERA)  SUM(BBA)  SUM(SOA)
0    CHN   3.69073     65398    101803

Pitchers only stop the other team from scoring runs.  If your batters aren't getting hist your ball club 
will be no good regardless of the strength of your pitchers.

In [158]:
hits_df = pd.read_sql_query("SELECT teamID, AB, H, HR FROM team_table WHERE yearID > 1881 AND (teamID = 'SLN' OR teamID = 'SL4' OR teamID = 'CHN') ORDER BY yearID", con)
hits_df.head()

  teamID    AB     H   HR
0    CHN  3225   892   15
1    SL4  2865   663   11
2    CHN  3658  1000   13
3    SL4  3495   891    7
4    CHN  4182  1176  142

## Need to find a way to read columns 2B and 3B

In [159]:
batting_df = pd.read_csv('../../../Desktop/Batting.csv', index_col=None, na_values=['NA'])
batting_df.to_sql("Batting_table", baseball, if_exists = "replace")

In [171]:
hr_batting_df = pd.read_sql_query("SELECT teamID, HR FROM batting_table WHERE yearID > 1882 AND (teamID = 'SLN' OR teamID = 'SL4' OR teamID = 'CHN') ORDER BY HR DESC", con)
hr_batting_df.head()

  teamID  HR
0    SLN  70
1    CHN  66
2    SLN  65
3    CHN  64
4    CHN  63

In [168]:
batting_df = pd.read_sql_query("SELECT teamID, HR FROM batting_table WHERE yearID > 1882 ORDER BY HR DESC", con)
batting_df.head()

  teamID  HR
0    SFN  73
1    SLN  70
2    CHN  66
3    SLN  65
4    CHN  64